[
    {
    "timestamp": "TBD",
    "title": "Double Counting",
    "presenter": "Bc. Matej Straka",
    "tags": [
      ["math", "Combinatorics"],
      ["math", "Graph Theory"]
    ],
    "description": "Explore the elegant technique of double counting through four classic theorems. We will cover the Handshaking Lemma, Cayley's Formula, the Erdős–Ko–Rado Theorem, and Mantel's Theorem. This talk will demonstrate how double counting provides clear, effective and beautiful proofs in combinatorics and graph theory."
  },
  {
    "timestamp": "22. 5. 2024",
    "title": "Exponential map generates all graphs from the connected ones",
    "presenter": "Bc. Jonáš Dujava",
    "tags": [
      ["math", "Combinatorics"],
      ["math", "Graph Theory"],
      ["math", "Generating Functions"]
    ],
    "description": "A large class of problems (in combinatorics, but also for example in QFT — notably Feynman diagrams) can be formulated as a sum over certain class of graphs, with weights that factorize for disjoint unions of graphs (with addition of implicit \"symmetry factors\"). Factorization of weights enables us to first decompose the graph into \"connected\" components, then perform the calculation independently on every component, and multiply the contributions at the end (often in combinatorics, when enumerating number of ways to carry out a certain task on an \\(n\\)-element set, we can first make all admissible partitions of the original set into blocks, and carry out the task on each block independently). <br> We will derive and demonstrate on examples the relation \\(\\displaystyle\\sum\\limits_{\\substack{\\text{all graphs}\\,G \\\\ \\text{for a given problem}}} \\frac{1}{|\\text{Aut}\\,G|} w[G] = \\exp\\left( \\sum\\limits_{\\substack{\\text{connected} \\\\ \\text{graphs}\\,\\gamma}}\\frac{1}{|\\text{Aut}\\,\\gamma|} w[\\gamma] \\right) \\), in words \"Exponential map generates contributions of all graphs from just the connected ones, with correct weights and symmetric factors.\" One can often extract interesting results from this relation, or immediately simplify the calculation to a more manageable set of contributions (just connected graphs instead of all graphs)."
  },
  {
    "timestamp": "22. 5. 2024",
    "title": "Universal approximation theorem vs Kolmogorov–Arnold",
    "presenter": "Bc. Tomáš Červeň",
    "tags": [
      ["comp-sci", "Machine Learning"],
      ["math", "Numerical Analysis"]
    ],
    "description": "A paper recently uploaded to ArXiv proposes an alternative to Multi Layer Perceptrons (MLPs) that plays a crucial role as a fundamental building block of many architectures. While MLPs are theoretically backed by a universal approximation theorem consisting of a fixed activation function with learnable weights, newly proposed KANs build upon a K-A representation theorem, making the activation functions learnable. We will explore both theorems and show how the paper mentioned uses Bezier curves and b-splines to represent an activation function. We will demonstrate some strengths of this alternative approach, namely \"locality\" and better interpretability.",
    "links": [
      {
        "href": "https://arxiv.org/abs/2404.19756",
        "text": "Kolmogorov-Arnold Networks paper"
      }
    ]
  },
  {
    "timestamp": "10. 4. 2024",
    "title": "Ants and Ising model",
    "presenter": "Bc. Jakub Kriš",
    "tags": [
      ["physics", "Statistical Physics"],
      ["math", "Probability Theory"]
    ],
    "description": "Based on the paper by Feinerman et al., we have explored how one is able to model the behaviour of ants during cooperative transport using Ising's model of ferromagnetism.",
    "links": [
        {
            "href": "https://doi.org/10.1038/s41567-018-0107-y",
            "text": "The physics of cooperative transport in groups of ants"
        }
    ]
  },
  {
    "timestamp": "TBD (anytime people are interested)",
    "title": "Counting Operators in Effective Field Theories",
    "presenter": "Bc. Jonáš Dujava",
    "tags": [
      ["math", "Group Theory"],
      ["physics", "Quantum Field Theory"],
      ["math", "Generating Functions"]
    ],
    "description": "The operators in an Effective Field Theory Lagrangian satisfy various relations that arise from equations of motion, integration by parts, and finite-dimensionality conditions. These relations can be systematically handled using group-theoretic techniques implemented in the so-called Hilbert series method, which enables us to compute a generating function that encodes the number of independent operators with a given number of derivatives and particle fields."
  },
  {
    "timestamp": "1. 5. 2024",
    "title": "Peierls's argument on the existence of phase transition in the Ising model",
    "presenter": "Bc. Marek Jankola",
    "tags": [
      ["physics", "Statistical Physics"]
    ],
    "description": "Ising proved that there is no phase transition in the 1D simplified model of ferromagnetism. However, the existence of phase transitions in higher dimensional models remained an opened question. Peierls provided an answer by reformulating the problem through boundaries and regions within. His answer established Ising model as physically relevant model of ferromagnetism.",
    "links": [
        {
            "href": "https://doi.org/10.1017/S0305004100019174",
            "text": "On Ising's model of ferromagnetism"
        }
    ]
  }
]
